<script setup lang="ts"></script>

<template>
  <section class="about-project">
    <div class="container">
      <div class="about-project__wrapper">
        <h2 class="about-project__title">О проекте</h2>
        <div class="about-project__body">
          <p>
            Проект «Как И.Д. Сытин открыл С.А. Есенина» представляет собой научно-популярный сноуфолл (интерактивный
            лонгрид), посвященный исследованию творческого пути поэта С.А. Есенина, важной частью которого стала его
            работа в типографии И.Д. Сытина.
          </p>
          <p>
            В центре внимания – фигура молодого поэта, который, оказавшись в Москве, погрузился в кипучую среду
            крупнейшего книгоиздательского предприятия начала XX века.
          </p>
          <p>
            Атмосфера сытинского дела с его масштабами, техническими новшествами, ориентацией на народного читателя,
            возможностью быть «внутри» литературного процесса и рядом с людьми книги рассматривается как фактор, во
            многом определивший стремительное развитие поэта, впоследствии не раз пользовавшимся ценным типографским
            опытом.
          </p>
          <p>
            Основной текст, подготовленный на базе авторитетных источников, содержит редкие сведения о жизни, творчестве
            и взаимодействии С.А. Есенина с сытинским издательским домом. Богатый иллюстративный материал, делающий
            повествование наглядным и вовлекающим, отличается высокой степенью мультимедийности и интерактивности.
          </p>
          <p>
            Сноуфолл предназначен для учащихся образовательных учреждений, где преподаются такие дисциплины, как история
            литературы, литературоведение, издательское дело, культурология, журналистика; а также для всех
            интересующихся жизнью и творчеством С.А. Есенина, новаторской деятельностью И.Д. Сытина, биографикой и
            издательскими практиками прошлого и настоящего.
          </p>
        </div>
      </div>
    </div>
  </section>
</template>

<style lang="scss">
  @use "@/assets/styles/core";
  @use "@/assets/styles/mixins";

  .about-project {
    padding: core.$spacing-8 0;
    background: core.$color-alabaster;

    &__title {
      text-align: center;
      @include mixins.apply-text("heading-2");
      margin-bottom: core.$spacing-6;
    }

    &__body {
      margin: 0 auto;
      max-width: 700px;
      display: flex;
      flex-direction: column;
      gap: core.$spacing-4;
      @include mixins.apply-text("body");
      text-indent: core.$spacing-6;
    }
  }
</style>
