<script setup lang="ts">
  import AppButton from "@/components/AppButton.vue";
  import { Icon } from "@iconify/vue";
  import { ref } from "vue";

  const isShow = ref(false);
</script>

<template>
  <section class="about-project">
    <div class="container">
      <div class="about-project__wrapper">
        <h2 class="about-project__title">
          О проекте
          <AppButton
            class="about-project__button"
            @click="isShow = !isShow"
          >
            <Icon
              class="about-project__icon"
              :class="{ ' about-project__icon--active': isShow }"
              icon="fa7-solid:chevron-down"
              width="24"
              height="24"
            ></Icon>
          </AppButton>
        </h2>
        <div
          class="about-project__body"
          v-if="isShow"
        >
          <p>
            Проект «Как И.Д. Сытин открыл С.А. Есенина» представляет собой научно-популярный сноуфолл (интерактивный
            лонгрид), посвященный исследованию творческого пути поэта С.А. Есенина, важной частью которого стала его
            работа в типографии И.Д. Сытина.
          </p>
          <p>
            В центре внимания – фигура молодого поэта, который, оказавшись в Москве, погрузился в кипучую среду
            крупнейшего книгоиздательского предприятия начала XX века. Атмосфера сытинского дела с его масштабами,
            техническими новшествами, ориентацией на народного читателя, возможностью быть «внутри» литературного
            процесса и рядом с людьми книги рассматривается как фактор, во многом определивший стремительное развитие
            поэта, впоследствии не раз пользовавшимся ценным типографским опытом.
          </p>
          <p>
            Текст сноуфолла – глубокое аналитическое исследование, опирающееся на авторитетные источники: мемуарные
            свидетельства, научные исследования, архивные материалы и редкие публикации, многие из которых впервые
            собраны и осмыслены в рамках одного проекта.
          </p>
          <p>
            Богатство фактического материала сочетается с тонкостью интерпретаций, поэтому в тексте факты не просто
            констатированы, а умело и глубоко осмыслены, между ними выявлены связи, им даны нюансированные трактовки и
            др. Благодаря этому известные и малоизвестные сведения предстают перед читателем во всей своей полноте и
            значимости. В равной мере это относится и к уникальным данным о жизни, творчестве и взаимодействии С.А.
            Есенина с сытинским издательским домом, и к масштабу влияния этого издательства на становление национального
            поэта.
          </p>
          <p>
            Фотографии с 3D-визуализацией, интерактивные журналы и карта, а также специально разработанные для проекта
            единый визуальный стиль и эмблема, символизирующая неразрывную связь великого поэта и великого издателя, –
            все это формирует насыщенный иллюстративный ряд. Благодаря высокой степени мультимедийности и
            интерактивности повествование обретает эффект иммерсивности, становясь не просто наглядным, а по-настоящему
            вовлекающим.
          </p>
          <p>
            Сноуфолл предназначен для учащихся образовательных учреждений, где преподаются такие дисциплины, как история
            литературы, литературоведение, издательское дело, культурология, журналистика; а также для всех
            интересующихся жизнью и творчеством С.А. Есенина, новаторской деятельностью И.Д. Сытина, биографикой и
            издательскими практиками прошлого и настоящего.
          </p>
        </div>
      </div>
    </div>
  </section>
</template>

<style lang="scss">
  @use "@/assets/styles/core";
  @use "@/assets/styles/mixins";

  .about-project {
    padding-bottom: core.$spacing-8;
    background: core.$color-alabaster;

    &__title {
      @include mixins.apply-text("heading-2");
      display: flex;
      gap: core.$spacing-1;
      width: fit-content;
      align-items: center;
      margin: 0 auto core.$spacing-6;
    }

    &__button {
      display: flex;
      place-items: center;
    }

    &__icon {
      transition: transform 0.2s ease;

      &--active {
        transform: rotate(180deg);
      }
    }

    &__body {
      text-align: justify;
      margin: 0 auto;
      max-width: 900px;
      @include mixins.apply-text("body");
      text-indent: core.$spacing-6;
    }
  }
</style>
