<script setup lang="ts">
  import Image360 from "@/components/Image360.vue";
  import MapViewer from "@/blocks/MapViewer.vue";
  import { Swiper, SwiperSlide } from "swiper/vue";
  import BookViewerFirst from "@/blocks/BookViewerFirst.vue";
  import BookViewerSecond from "@/blocks/BookViewerSecond.vue";
  import { Navigation, Pagination } from "swiper/modules";
  import AppButton from "@/components/AppButton.vue";
  import { Icon } from "@iconify/vue";
</script>

<template>
  <div class="app-content">
    <div class="container">
      <div class="app-content__widthed">
        <p>
          Все мы знаем С.А. Есенина – сверхталантливого хулигана, певца рязанских раздолий. Но что мы знаем о том, как
          он рос? Как мальчик из крестьянской семьи превратился в поэта, чьи стихи гремели на всю Россию? Каково было
          его детство, как и под чьим влиянием поселилась в нем любовь к книге, слову, зародились те самые внутренние
          порывы, которые привели в Москву и в конечном счете в типографию И.Д. Сытина? Обо всем по порядку.
        </p>
      </div>
      <div class="app-content__wrapper">
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="368px"
              thumbnail-height="258px"
              modal-width="564px"
              modal-height="395px"
              front-image="images/blocks/2.jpeg"
            />
            <p class="app-content__image-caption">
              Дом Никиты Осиповича Есенина (деда поэта). Здесь родился С.А. Есенин. Рисунок сделан по рассказу отца
              поэта художницей Л. Милеевой.
            </p>
          </div>
          <div class="app-content__body-text">
            <p>
              «Я родился в 1895 году 21 сентября в селе Константинове Кузьминской волости, Рязанской губернии и
              Рязанского уезда», – так поэт начинает свой автобиографический очерк.
            </p>
            <p>
              21 сентября (3 октября по новому стилю) 1895 года был отмечен историческим для России событием. 20-21
              сентября 1895 года Рязань праздновала свое 800-летие. Во всех уголках Рязанщины звонили колокола и шумели
              народные гулянья. Древняя русская земля как будто приветствовала рождение своего гения.
            </p>
            <p>
              С.А. Есенин был крещен в Константиновской церкви иконы Казанской Божией Матери и наречен Сергеем в честь
              Сергия Радонежского.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              Старинное русское село Контантиново, раскинувшееся вдоль холмистого правого берега Оки, насчитывало около
              шестисот дворов. Оно пролегло широкой прямой улицей, которая тянулась на несколько километров, потому что
              к ней примыкали деревня Волохна и большое село Кузьминское.
            </p>
            <p>
              «Наше Константиново было тихое, чистое, утопающее в зелени село», – вспоминала позже сестра поэта
              Александра Александровна.
            </p>
            <p>Дом Есениных находился в самом центре села Константиново.</p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="637px"
              thumbnail-height="649px"
              modal-width="637px"
              modal-height="649px"
              front-image="images/blocks/3.jpeg"
            />
            <p class="app-content__image-caption">Вид на село Константиново с заливных лугов</p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="483px"
              thumbnail-height="700px"
              modal-width="483px"
              modal-height="700px"
              front-image="images/blocks/2.2.jpeg"
            />
            <p class="app-content__image-caption">Вид на село Константиново с заливных лугов</p>
          </div>
          <div class="app-content__body-text">
            <p>
              Родители Есенина поженились очень рано, когда отцу было восемнадцать, а матери шестнадцать с половиной
              лет.
            </p>
            <p>
              Отец Есенина – Александр Никитич Есенин, с детства был известен по всей округе своим прекрасным голосом.
              Он слыл немного чудаковатым, потому что не пил и любил читать книги. Когда пришло время жениться, его
              выбор пал на первую красавицу и лучшую в селе песенницу Татьяну Федоровну Титову.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              Жизнь родителей Есенина не заладилась. Когда Сергею пошел четвертый год, он с матерью много времени
              проводил в доме ее родителей – Натальи Евтихиевны и Федора Андреевича Титовых. «Я рос, – вспоминал позже
              Есенин, – дыша атмосферой народной поэзии. Бабка, которая меня очень баловала, была очень набожна,
              собирала нищих и калек, которые распевали духовные стихи… Еще больше значения имел дед, который сам знал
              множество духовных стихов наизусть и хорошо разбирался в них».
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="684px"
              thumbnail-height="722px"
              modal-width="400px"
              modal-height="400px"
              front-image="images/blocks/2.3.png"
            />
            <p class="app-content__image-caption">
              Отец поэта А.Н. Есенин с дедом поэта Федором Андреевичем Титовым. Константиново.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="409px"
              thumbnail-height="517px"
              modal-width="507px"
              modal-height="641px"
              front-image="images/blocks/2.5.jpg"
            />
            <p class="app-content__image-caption">
              С.А. Есенин с отцом (слева) и дядей Иваном Никитичем Есениным. Москва, лето, 1912 г.
            </p>
          </div>
          <div class="app-content__body-text">
            <p>
              Читать поэт научился в 5 лет под руководством дяди. С тех пор чтение стало одним из самых любимых занятий.
              «Насколько я себя помню, помню и толстые книги, в кожаных переплетах», – вспоминал он.
            </p>
            <p>
              По собственным словам, стихи начал складывать рано, лет восьми-девяти. Друзья детства позже вспоминали,
              что это были строки о природе. Сам Есенин не раз говорил о том, как много значили для него как поэта не
              только образный строй русского фольклора, частушек, песен, сказок и духовных стихов, но и впечатления от
              родной природы, «уличной» жизни, не похожей на домашнюю: ширь полей и синь небес, голубая гладь озер,
              луна, стоящая «стоймя в воде».
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              В сентябре 1904 года Есенин поступил в Константиновское земское училище. Обучение в училище было
              рассчитано на четыре года. Кроме чтения, письма, арифметики, русской истории и географии изучали
              религиозные предметы – священную историю, Евангелие и молитвенник. Училище было небольшое, всего четыре
              класса. Оно помещалось почти напротив дома Есениных.
            </p>
            <p>
              «Есенин, – как вспоминал один из его товарищей по училищу, – уже тогда выделялся среди нас. И учителя и
              мы, ученики, любили его за прямоту и веселый нрав. Был он первый заводила, бедовый и драчливый, как петух…
              Одарен он был ясным умом. Отвечал на уроках бойко. Особенно когда читал стихи Некрасова, Кольцова и других
              поэтов… Была у нас и школьная библиотекa. По тем временам неплохая. Имелись в ней книги Пушкина, Гоголя,
              Тургенева, Некрасова, Лермонтова, Толстого, стихи крестьянских поэтов Кольцова и Никитина».
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="461px"
              thumbnail-height="240px"
              modal-width="461px"
              modal-height="240px"
              front-image="images/blocks/2.7.jpeg"
            />
            <p class="app-content__image-caption">Константиновское земское училище</p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="427px"
              thumbnail-height="618px"
              modal-width="427px"
              modal-height="618px"
              front-image="images/blocks/2.8.png"
            />
            <p class="app-content__image-caption">Священник отец Иоанн, Рязань, 1903 г.</p>
          </div>
          <div class="app-content__body-text">
            <p>
              Большое влияние на духовное становление будущего поэта оказал сельский священник отец Иоанн (в миру – Иван
              Яковлевич Смирнов). Он служил в Константиновской церкви и преподавал в школе уроки закона Божьего. Сергей
              нередко бывал в доме священника.
            </p>
            <p>
              Отец Иван много читал, из года в год выписывал «Ниву» с литературными приложениями и газету «Русское
              слово». В семье священника была хорошая библиотека, которой мог пользоваться будущий поэт.
            </p>
            <p>
              По словам школьных товарищей, к последнему классу школы он прочитал массу книг. Мать поэта, женщина
              неграмотная, но мудрая, вспоминала о сыне: «Читал он очень много всего. Жалко мне его было, что он много
              читал, утомлялся. Я подойду погасить его огонь, чтобы он лег, уснул, но он на это не обращал внимания. Он
              опять зажигал и читал. Дочитается до такой степени, что рассветет и не спавши он поедет учиться опять».
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              В мае 1909 года Есенин с похвальным листом окончил Константиновское земское училище. Особенно гордился
              этой наградой отец Сергея, потому что похвальный лист редко кто имел в Константинове. По этому случаю он
              неожиданно приехал из Москвы (где работал в мясной лавке) и повесил похвальный лист своего сына в красивую
              рамку со стеклом. Александр Есенин был единственным в то время в селе отцом, который отправил своего сына
              после окончания училища не на заработки, а учиться.
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="563px"
              thumbnail-height="492px"
              modal-width="563px"
              modal-height="492px"
              front-image="images/blocks/2.9.jpg"
            />
            <p class="app-content__image-caption">
              Похвальный лист, полученный С. Есениным по окончании Константиновского земского училища в 1909 г.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="333px"
              thumbnail-height="530px"
              modal-width="464px"
              modal-height="739px"
              front-image="images/blocks/2.10.jpg"
            />
            <p class="app-content__image-caption">Евгений Михайлович Хитров с женой</p>
          </div>
          <div class="app-content__body-text">
            <p>
              Родители поэта хотели, чтобы из него вышел сельский учитель. В сентябре 1909 года Сергея Есенина отдали в
              церковно-учительскую школу (село Спас-Клепики Рязанского уезда). Один из учителей Сергея, старший
              преподаватель Евгений Михайлович Хитров, который фактически руководил жизнью школы, вспоминал: «Знания его
              были шире положенной программы. Он много читал». Больше всего поэту нравился Лермонтов и Кольцов, позже он
              «перешел к Пушкину».
            </p>
            <p>
              В обычае Хитрова было читать целиком в классе большие произведения вроде «Евгения Онегина», «Бориса
              Годунова» и пр. «Но думаю, – вспоминал он, – не было такого жадного слушателя у меня, как Есенин. Он
              впивался в меня глазами, глотал каждое слово. У него первого заблестят глаза и появятся слезы в печальных
              местах, первый расхохочется при смешном».
            </p>
            <p>Обладая замечательной памятью, Есенин знал прочитанные в детстве произведения наизусть.</p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              Часто в свободное от уроков время Есенин с товарищами бывал в семье своего школьного товарища Гриши
              Панфилова.
            </p>
            <p>
              Отец и сын Панфиловы были большими книголюбами и много читали. Особенно любили Горького, Чехова, Никитина,
              Лермонтова. Почти стихийно в доме Панфиловых сложился кружок молодежи, где увлекались толстовскими идеями,
              читали и спорили о романе Толстого «Воскресение», трактате «В чем моя вера», о книгах Горького, обсуждали
              вопросы современной общественной жизни.
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="500px"
              thumbnail-height="310px"
              modal-width="678px"
              modal-height="420px"
              front-image="images/blocks/2.12.jpeg"
            />
            <p class="app-content__image-caption">
              Григорий Панфилов и Сергей Есенин. Фрагмент групповой фотографии выпускного класса Спас-Клепиковской
              учительской школы, 1911 г.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="516px"
              thumbnail-height="430px"
              modal-width="785px"
              modal-height="654px"
              front-image="images/blocks/2.14.jpg"
            />
            <p class="app-content__image-caption">
              Автограф стихотворения «Звезды» из тетради, подаренной Е.М. Хитрову
            </p>
          </div>
          <div class="app-content__body-text">
            <p>
              Свои стихи Есенин показывал товарищам и учителю русского языка и литературы E.М. Хитрову. Первым
              стихотворением, поразившим учителя, было стихотворение «Звезды» («Звездочки ясные, звезды высокие!..»).
            </p>
            <p>
              Написанное под влиянием поэзии Лермонтова, оно говорило о силе великого знания и вечных тайнах мироздания.
              Хитров сказал своему ученику, что «Звезды» можно даже напечатать и что у Есенина «ясно выраженный талант».
            </p>
            <p>
              Юный поэт не стал печатать это стихотворение, но поддержка учителя его вдохновила. С тех пор он часто
              приносил ему свои стихи.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              Однажды учитель попросил Есенина написать ему сборничек своих стихов. В ответ на эту просьбу Есенин
              написал Хитрову две тетради по пять стихотворений. В первую тетрадь он поместил «Звезды», «Воспоминание»
              («За окном у ворот…»), «Моя жизнь», «Что прошло – не вернуть», «И.Д. Рудинскому». На обложке рукой поэта
              начертано: «Сергей Есенин». Во второй тетради – «Ночь» («Тихо дремлет река…»), «Восход солнца», «К
              покойнику», «Зима», «Песня старика разбойника».
            </p>
            <p>
              Позже, в начале 1916 года, когда вышла первая книга Есенина «Радуница», автор прислал ее своему первому
              литературному наставнику с дарственной надписью: «Доброму старому учителю Евгению Михайловичу Хитрову от
              благодарного ученика, автора этой книги. 1916. 29 янв., Петроград».
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="454px"
              thumbnail-height="573px"
              modal-width="454px"
              modal-height="573px"
              front-image="images/blocks/2.15.jpg"
              back-image="images/blocks/fallback.png"
            />
            <p class="app-content__image-caption">Тетрадь со стихами Сергея Есенина, подаренная им Е.М. Хитрову</p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="451px"
              thumbnail-height="283px"
              modal-width="574px"
              modal-height="360px"
              front-image="images/blocks/2.16.jpeg"
            />
            <p class="app-content__image-caption">
              Общежитие в Большом Строченовском переулке, принадлежавшее купцу Н.В. Крылову
            </p>
          </div>
          <div class="app-content__body-text">
            <p>
              В конце июля 1912 года Есенин выехал из Константинова в Москву на постоянное место жительства. Первый
              московский адрес – Строченовский переулок, дом 24, квартира 11, где жил его отец (в настоящее время здесь
              находится первый Московский государственный музей С.А. Есенина).
            </p>
            <p>Есенин уже приезжал сюда на неделю летом 1911 года, навестил отца и купил книг «штук 25».</p>
            <p>
              В Москве Есенин сначала поступил на работу в контору владельца мясной лавки купца Н.В. Крылова, где
              приказчиком работал его отец. Но поэта привело в город желание найти пути в большую литературу и
              попробовать свои силы в поэзии. Каких-либо связей в писательских кругах он не имел, имя его в печати не
              было известно. Оторванный от родной деревенской стихии, Есенин оказался в первые месяцы жизни в чужом ему
              городе в обстановке духовной изоляции.
            </p>
            <p>
              Совсем скоро Есенину пришлось оставить работу в конторе купца Крылова. Начались распри с отцом. Жизнь
              складывалась трудно и совсем не так, как хотелось юноше.
            </p>
            <p>
              Однако именно отец, желая устроить Сергея куда-либо на более прочное место, попросил знакомого корректора
              фабрики Сытина (Костелева Алексея Саввича) оказать содействие и в результате в марте 1913 года Сергей
              Есенин поступил на фабрику издательства Сытина.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              Типография «товарищества И. Д. Сытина», где Есенин сначала работал грузчиком в экспедиции, помощником
              корректора, а потом корректором, была крупнейшей в России.
              <a
                href="#map"
                class="app-content__body-text--link-to-map"
              >
                Адрес: г. Москва, Пятницкая улица, дом 71/5.
              </a>
              Каждая четвертая русская книга печаталась здесь. Сам хозяин приехал в Москву, будучи еще моложе Есенина
              (четырнадцати лет), из костромской глуши. Так же, как Есенин, без копейки в кармане. По- есенински, без
              отцовской помощи, поступил «мальчиком на побегушках» в книжную лавку на Никольском рынке, что раскинулся
              возле Китайгородской стены. (Есенин двадцатью годами позже, как и Сытин, зарабатывал какое-то время на
              жизнь в книжной лавке на Страстной площади.)
            </p>
            <p>
              Четыре года Сытин отворял в книжной лавке дверь посетителям. Но, как вспоминает писатель Н.Д. Телешов:
              «Призванный "отворять двери" в книжную лавку, Сытин впоследствии... во всю ширь распахнул дверь к книге,
              так распахнул, что через отворенную дверь он вскоре засыпал печатными листами города и деревни, и самые
              глухие "медвежьи углы" России».
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="437px"
              thumbnail-height="547px"
              modal-width="437px"
              modal-height="547px"
              front-image="images/blocks/2.17.png"
              back-image="images/blocks/fallback.png"
            />
            <p class="app-content__image-caption">И.Д. Сытин</p>
          </div>
        </div>
        <MapViewer />
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="508px"
              thumbnail-height="381px"
              modal-width="508px"
              modal-height="381px"
              front-image="images/blocks/2.18.jpg"
            />
            <p class="app-content__image-caption">Одно из подразделений типографии И.Д. Сытина.</p>
          </div>
          <div class="app-content__body-text">
            <p>
              Интересы народного просвещения для Сытина всегда были выше интересов предпринимательских. Он был человеком
              из породы Третьяковых, Мальцевых, Сувориных, Морозовых, работавших для России и ценивших русского
              человека.
            </p>
            <p>
              «История приобщения деревни, народных масс к печатному слову, к русской литературе, к просвещению,
              народная школа и популяризация знания тесно связаны с его именем. Практический деятель широкого размаха,
              Иван Дмитриевич соединил свою творческую работу с идеей служения народу в самых высоких путях его. Он
              создавал культурные орудия для обработки духовной нивы, облегчал средства проникновения в темную жизнь
              светлых идей лучших наших умов и талантов. Заслуги его перед Родиной велики и неоспоримы», – писал князь
              Г.Е. Львов о Сытине.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              Из мемуарной литературы известно о любви и интересе Есенина к типографскому делу. Свидетель его жизни
              1913-1914 гг. Г.Д. Деев-Хомяковский писал: «Фабрика с ее гигантскими размахами и бурливой жизнью произвела
              на Есенина громадное впечатление. Он был весь захвачен работой на ней и даже бросил было писать стихи».
              Примечательно, что в стенах сытинской типографии (в 1925-1926 гг. – Первой, ныне Первой образцовой),
              наверное, на том же оборудовании, печаталось при жизни Есенина его Собрание стихотворений, ставшее
              посмертным.
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="542px"
              thumbnail-height="404px"
              modal-width="819px"
              modal-height="610px"
              front-image="images/blocks/2.19.png"
            />
            <p class="app-content__image-caption">Типография И.Д. Сытина. Наборная. Скоропечатные машины. 1907 г.</p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="383px"
              thumbnail-height="535px"
              modal-width="485px"
              modal-height="678px"
              front-image="images/blocks/2.19_1.png"
            />
            <p class="app-content__image-caption">С.А. Есенин, 1913 г.</p>
          </div>
          <div class="app-content__body-text">
            <p>
              Иван Спиридонович Рахилло, русский советский писатель, цитируя старого наборщика А.Д. Андреева, с которым
              в двадцатых годах он проживал в одной комнате в «Лоскутной» гостинице, у Охотного ряда, писал в своих
              воспоминаниях о Есенине: «А я-то Сергея знавал еще совсем безусым. У Сытина вместе работали… По виду
              Есенину было лет шестнадцать-семнадцать. Невысокий, белокурый. Нам он очень понравился, живой такой,
              любознательный, хорошо читал наизусть Пушкина и Лермонтова. Первое время ему негде было жить, и он ночевал
              в комнатке при типографии. Его устроили в корректорскую. Не раз читывал он нам свои стихи и даже где-то их
              печатал. В каких-то небольших журнальчиках. Страсть как любил типографское дело, изучал шрифты, печатные
              машины, охоч был до хорошей бумаги – все мечтал, когда ему книжку напечатают. Стихи у него были грустные,
              но правдивые. О деревне. Нам очень нравились. Брали за душу...»
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              Общение с рабочими и работа в типографии, где печатались книги писателей-классиков и современных
              отечественных и зарубежных авторов, сыграла большую роль в духовном становлении поэта.
            </p>
            <p>
              Есть сведения о том, что Есенин считывал тома собраний сочинений В. Гюго и Г. Сенкевича, по рукописям
              сверял произведения Л. Толстого, К. Бальмонта и др. и покупал выходившие у Сытина книги. Обладая
              феноменальной памятью, поэт, по словам знавших его людей, впитывал за день больше, чем другой за год.
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="499px"
              thumbnail-height="313px"
              modal-width="499px"
              modal-height="313px"
              front-image="images/blocks/2.20.jpg"
            />
            <p class="app-content__image-caption">
              С.А. Есенин среди работников типографии Товарищества И.Д. Сытина, Москва, 1914 г.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="520px"
              thumbnail-height="295px"
              modal-width="520px"
              modal-height="295px"
              front-image="images/blocks/2.21.png"
            />
            <p class="app-content__image-caption">
              С.А. Есенин на занятиях кружка самообразования работников типографии Товарищества И.Д. Сытина, 1914 г.
            </p>
          </div>
          <div class="app-content__body-text">
            <p>
              Также нам известно, что в бытность свою корректором типографии Есенин участвовал в рабочих собраниях,
              распространял журнал «Огни», имевший демократическую направленность. Но считать это сознательной
              революционной деятельностью, идущей от внутренних побуждений, нельзя. Духовно и мировоззренчески Есенин не
              был подготовлен к сознательной революционной деятельности. Его контакты с рабочим движением в Москве были
              поверхностными и не стали следствием внутренних убеждений. Он не стал ни «певцом революции», ни
              сознательным революционером, оставшись поэтом, ищущим признания на литературном поприще. Стихи на эту тему
              («Кузнец», «У могилы») поэт впоследствии не включал в свои сборники и никогда о них не вспоминал.
            </p>
            <p>
              Однако эта работа в коллективе сытинцев, ведших организованную борьбу за свои права, оказала на поэта
              сильное влияние и была для него полезной. Подышав воздухом типографии, Есенин все больше начинает
              размышлять о жизни, стремится постичь ее смысл, как-то самоопределиться в ней, осознать ее сложность и
              неустроенность.
            </p>
            <p>
              В творчестве Есенина этих лет усиливаются демократические тенденции и возникают новые темы, расширявшие
              диапазон его поэзии. В поэме «Марфа Посадница» содержится осуждение деспотизма царя Ивана III и
              прославление новогородской вольницы. В стихотворениях «Узоры», «Молитва матери», «Богатырский посвист»
              Есенин пишет об империалистической войне.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              Также под влиянием и с помощью сытинцев он поступает в народный университет им. А.Л. Шанявского,
              завязывает связи с суриковцами и становится членом этого кружка. Все это помогает ему расширить и углубить
              знания родной литературы, ближе познать новую для него жизнь города.
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="462px"
              thumbnail-height="275px"
              modal-width="665px"
              modal-height="396px"
              front-image="images/blocks/2.22.jpeg"
            />
            <p class="app-content__image-caption">Московский городской народный университет имени А. Л. Шанявского.</p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              В Москве Есенин все больше времени уделяет творчеству. Желание опубликовать свои стихи было огромным. И
              Есенин обращается к редактору печатающихся у Сытина журналов «Вокруг света» и «Мирок»» В.А. Попову. В
              январе 1914 года в первом номере детского журнала «Мирок» было опубликовано есенинское стихотворение
              «Береза».
            </p>
            <p>
              А.Д. Андреев, работавший в те года вместе с Есениным у Сытина, вспоминал: «С самого раннего утра он
              дежурил в типографии – ожидание выхода журнала не давало ему всю ночь сомкнуть глаз. И вот первый
              экземпляр у него в руках, тощенький, бесхитростный, наивный, но такой для него дорогой. Он подышал запахом
              краски свежего оттиска, потом развернул. Вот он, скромный столбик коротких строчек…»
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              «Береза» – первое из известных печатных выступлений поэта. Оно было подписано псевдонимом «Аристон».
              Источниками происхождения псевдонима являются стихотворения Державина «К лире» и Пушкина «К другу
              стихотворцу». В обоих этих стихах авторы называют Поэта, Певца «аристом» (интересно, что в переводе с
              греческого «Аристон» означает «самый лучший»). Гонорар за эту публикацию поэт отдал отцу, чтобы
              расположить его к своим литературным занятиям.
            </p>
            <p>
              Кроме того, в № 2 того же журнала опубликованы стихотворения «Воробышки» и «Пороша», в № 3 – «Село», в № 4
              – «Пасхальный благовест», в № 12 – «Сиротка. Русская сказка».
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="421px"
              thumbnail-height="537px"
              modal-width="466px"
              modal-height="624px"
              front-image="images/blocks/2.23.24.jpg"
            />
            <p class="app-content__image-caption">
              Страница со стихотворением "Береза" из журнала "Мирок" за январь 1914 г., Тип. тов-ва И.Д. Сытина.
            </p>
          </div>
        </div>
        <div class="app-content__books">
          <swiper
            :slides-per-view="1"
            :space-between="50"
            :navigation="{ prevEl: '.app-content__navigation-prev', nextEl: '.app-content__navigation-next' }"
            :pagination="{ clickable: true }"
            :modules="[Navigation, Pagination]"
          >
            <swiper-slide>
              <div class="app-content__book">
                <BookViewerFirst />
              </div>
            </swiper-slide>
            <swiper-slide>
              <div class="app-content__book">
                <BookViewerSecond />
              </div>
            </swiper-slide>
            <AppButton class="app-content__navigation-prev">
              <Icon
                icon="fa7-solid:chevron-left"
                width="24"
                height="24"
              ></Icon>
            </AppButton>
            <AppButton class="app-content__navigation-next">
              <Icon
                icon="fa7-solid:chevron-right"
                width="24"
                height="24"
              ></Icon>
            </AppButton>
          </swiper>
        </div>
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="395px"
              thumbnail-height="549px"
              modal-width="446px"
              modal-height="620px"
              front-image="images/blocks/2.25.jpg"
            />
            <p class="app-content__image-caption">
              Фрагмент фотографии С.А. Есенина с М.П. Мурашевым, Петроград, 1916 г.
            </p>
          </div>
          <div class="app-content__body-text">
            <p>
              Типографский период в биографии Есенина оказался не просто прологом к большой литературе. Время,
              проведенное в сфере книгоиздания, дало поэту не только первые профессиональные знакомства, которые в
              немалой степени повлияли на его становление как поэта, но и уникальные практические навыки. Доскональное
              знание издательской кухни превратилось впоследствии в тот самый инструмент, которым Есенин пользовался с
              редким энтузиазмом и толком на всем протяжении своего творческого пути.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              В обширной мемуаристике содержится немало свидетельств о профессиональном интересе поэта к издательскому
              делу. Вс. Иванов в набросках воспоминаний, написанных десятилетия спустя после смерти Есенина, специально
              отметил: «...он любил рассуждать об издательской деятельности. Ему хотелось открыть издательство и
              печатать журнал».
            </p>
            <p>
              В 1932 г. непосредственный участник выпуска книг имажинистами Вадим Шершеневич утверждал: «Мы с
              Мариенгофом были плохими издателями. Практически издавали Кусиков и Есенин. Оба они это дело знали и
              любили, и чем труднее было издавать, тем больше азартного желания рождалось в них».
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="402px"
              thumbnail-height="587px"
              modal-width="402px"
              modal-height="587px"
              front-image="images/blocks/2.26.jpeg"
            />
            <p class="app-content__image-caption">
              Слева направо: А. Мариенгоф, С. Есенин, А. Кусиков, А. Шершеневич. Москва, 1920 г.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="380px"
              thumbnail-height="542px"
              modal-width="380px"
              modal-height="542px"
              front-image="images/blocks/2.27.jpeg"
            />
            <p class="app-content__image-caption">Сергей Есенин. Москва, 1914 г.</p>
          </div>

          <div class="app-content__body-text">
            <p>
              Есенина по праву можно назвать одним из самых деятельных издателей своего времени. Школу издательского
              дела он прошел в юности – и прежде всего в знаменитой типографии И.Д. Сытина, где в 1912 году началась его
              самостоятельная жизнь. Именно там складывалось то профессиональное чутье, которое впоследствии позволило
              поэту не только мечтать о книгах, но и уверенно участвовать в их создании.
            </p>
            <p>
              В 1913-1914 годах он уже активно работает над выпуском журнала «Друг народа», а год спустя в Петрограде
              задумывает собственное крестьянское издание с отделом «Деревня», где намеревается «познакомить читателя с
              тем, как живет, чем болеет крестьянин».
            </p>
            <p>
              Масштаб его издательской активности поражает: за пятнадцать лет творческой жизни Есенин подготовил и
              замыслил не меньше 130-ти авторских сборников, из которых увидели свет 33 книги, включая посмертное
              Собрание стихотворений, а также 30 коллективных сборников. При этом он не раз заявлял о намерении
              выпускать в Москве собственный журнал или литературный альманах.
            </p>
          </div>
        </div>
        <div class="app-content__body">
          <div class="app-content__body-text">
            <p>
              Позже Николай Вержбицкий вспомнит, как когда-то наблюдал за реакцией Есенина, посетившего в Тифлисе
              типографию издательства «Заря Востока»: «Войдя в наборный цех, он начал как-то странно поводить носом, и
              на лице у него появилась довольная улыбка. А взгляд любовно скользил по наборным кассам, по печатным
              станкам, по талеру, на котором уже заканчивалась верстка одной полосы газеты. Вскоре я убедился, что
              Есенин хорошо разбирается в типографском деле... Потом он еще много раз навещал меня в типографии и всегда
              говорил, что запах типографской краски напоминает ему юность и какие-то приятные и интересные события...
              Есенин быстро сошелся со всеми рабочими...»
            </p>
          </div>
          <div class="app-content__image-wrapper">
            <Image360
              class="app-content__image"
              thumbnail-width="523px"
              thumbnail-height="363px"
              modal-width="523px"
              modal-height="363px"
              front-image="images/blocks/2.28.png"
            />
            <p class="app-content__image-caption">Здание редакции газеты «Заря Востока»</p>
          </div>
        </div>
      </div>
      <div class="app-content__resume">
        <p>
          Таким образом, мы можем заявить, что именно И.Д. Сытин «открыл» Есенина, потому как именно работа в этой
          типографии стала для поэта той самой «взлетной полосой», с которой начался его путь в большую литературу.
        </p>
        <p>
          Здесь, в крупнейшем издательстве России, крестьянский юноша обрел не только первые значимые знакомства, но и
          прошел уникальную школу книжного дела, впервые увидел свои стихи напечатанными и досконально изучил
          издательское ремесло.
        </p>
        <p>
          Заложенные Сытиным принципы – открытость издательского дела для талантливого человека из любой среды,
          доступность книги широкому читателю и внимание к профессиональному росту сотрудников – оказались удивительно
          жизнеспособны.
        </p>
        <p>
          Сегодня инновации в организации книжного производства – от цифровых платформ до демократизации доступа к
          печати – во многом продолжают ту же логику: дать слово автору независимо от его происхождения, создать среду,
          где талант может быть замечен и выращен. И в этом смысле сытинский опыт остается не просто историей, а
          работающим ориентиром для современного издательского дела.
        </p>
      </div>
    </div>
  </div>
</template>

<style lang="scss">
  @use "@/assets/styles/core";
  @use "@/assets/styles/mixins";

  .swiper {
    overflow: visible;
  }

  .swiper-pagination {
    bottom: -50px !important;
  }

  .swiper-pagination-bullet {
    height: 13px;
    width: 13px;

    &-active {
      background: core.$color-red-oxide;
    }
  }

  .app-content {
    padding: core.$spacing-8 0;
    background: core.$color-alabaster;

    &__body {
      display: grid;
      grid-template-columns: 1fr 1fr;
      @include mixins.apply-text("body");
      gap: core.$spacing-8;
    }

    &__body-text {
      text-align: justify;
      text-indent: core.$spacing-6;

      &--link-to-map {
        color: core.$color-red-oxide;

        border-bottom: 2px solid transparent;

        @include mixins.hover {
          border-bottom: 2px solid core.$color-red-oxide;
        }
      }
    }

    &__books {
      padding-bottom: 50px;
    }

    &__book {
      margin: 0 auto;
      max-width: 860px;
    }

    &__widthed {
      max-width: 600px;
      margin: 0 auto core.$spacing-8;
      @include mixins.apply-text("body");
      text-align: justify;
      text-indent: core.$spacing-6;
    }

    &__resume {
      max-width: 600px;
      margin: core.$spacing-8 auto 0;
      @include mixins.apply-text("body");
      text-align: justify;
      text-indent: core.$spacing-6;
    }

    &__navigation-prev,
    &__navigation-next {
      position: absolute;
      top: 50%;
      z-index: 1000;
    }

    &__navigation-prev {
      left: 0;
      right: auto;
    }

    &__navigation-next {
      left: auto;
      right: 0;
    }

    &__wrapper {
      display: flex;
      flex-direction: column;
      gap: core.$spacing-8;
    }

    &__image-caption {
      @include mixins.apply-text("caption");
      padding-top: core.$spacing-2;
      max-width: 300px;
      color: #646464;
      margin: 0 auto;
    }

    &__image-wrapper {
      text-align: center;
    }

    &__image {
      margin: 0 auto;
    }
  }
</style>
