<script setup lang="ts">
  import AppButton from "@/components/AppButton.vue";
  import { Icon } from "@iconify/vue";
  import { ref } from "vue";

  const isShow = ref(false);
</script>

<template>
  <div class="app-sources">
    <div class="container">
      <div class="app-sources__wrapper">
        <h2 class="app-sources__title">
          Источники
          <AppButton
            class="app-sources__button"
            @click="isShow = !isShow"
          >
            <Icon
              class="app-sources__icon"
              :class="{ 'app-sources__icon--active': isShow }"
              icon="fa7-solid:chevron-down"
              width="24"
              height="24"
            ></Icon>
          </AppButton>
        </h2>

        <div
          class="app-sources__body"
          v-if="isShow"
        >
          <p>Андреев, А.Д. Есенин. Легенда. – Москва: Московский рабочий, 1973. – 344 с.</p>
          <p>В мире Есенина / сост. А.А. Михайлов, С.С. Лесневский. – Москва: Советский писатель, 1986. – 654 с.</p>
          <p>В Россию, в Константиново, к Есенину. Фотоальбом. – Рязань: Пресса, 2006. – 272 с.: ил.</p>
          <p>Динерштейн, Е.А. Деятели книги. И. Д. Сытин. – Москва: Книга, 1983. – 271 с.</p>
          <p>
            Есенин, С.А. Полное собрание сочинений: в 7 т. Т. 7. Книга третья: Утраченное и ненайденное.
            Неосуществленные замыслы. Есенин в фотографиях. Канва жизни и творчества. Библиография. Указатели / общ,
            ред. С.И. Субботина. – Москва: Наука, 2001. – 768 с.
          </p>
          <p>
            Есенина, Т.Ф. О сыне // С.А. Есенин в воспоминаниях современников: в 2-х т. Т. 1 / вступ. ст., сост. и
            коммент. А. Козловского. – Москва: Художественная литература, 1986. – 511 с.
          </p>
          <p>Есенина, А.А. Родное и близкое. – Москва: Советская Россия, 1979. – 96 с.</p>
          <p>
            Сытин, И.Д. Жизнь для книги / Сост. и подготовка текста А. З. Окорокова; Предисл. Н. Накорякова. – Москва:
            Госполитиздат, 1962. – 279 с., 6 л. ил.: ил. – (Из истории книги и издательского дела в России).
          </p>
          <p>
            Музей Есенина в книге / собрал материалы для музея, разраб. его экспозицию и представил читателю А.
            Базавлук. Москва: Конкорд-Пресс, 1995. 321 с.
          </p>
          <p>
            Полвека для книги: литературно-художественный сборник, посвященный 50-летию издательской деятельности И.Д.
            Сытина. – Москва: Тип. т-ва И.Д. Сытина, 1916. –610 с.
          </p>
          <p>Прокушев, Ю.Л. Колыбель поэзии: очерк. – Москва: Детская литература, 1982. – 175 с.</p>
          <p>Прокушев, Ю.Л. Сергей Есенин: Образ. Стихи. Эпоха. – Москва: Молодая гвардия, 1989. – 349 с.</p>
          <p>
            Рахилло, И.С. Встречи с Есениным // О Есенине / сост., вступ. ст. и прим. С.П. Кошечкина. – Москва: Правда,
            1990. – 640 с.
          </p>
          <p>Рууд, Ч. Русский предприниматель московский издатель Иван Сытин. – Москва: ТЕРРА, 1996. – 282 с.</p>
          <p>
            Солобай, Н.М. Неизвестные материалы об издательской деятельности Есенина (1921 г.) // Литературный факт. –
            2023. – №3 (29). – С. 174–184.
          </p>
          <p>
            Шубникова-Гусева Н.И. С.А. Есенин в жизни и творчестве: учебное пособие. – Москва: Русское слово – учебник,
            2019. – 112 с.
          </p>
          <p>
            Юшин, П.Ф. Поэзия Сергея Есенина 1910–1923 годов. – Москва: Издательство Московского университета, 1966. –
            316 с.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<style lang="scss">
  @use "@/assets/styles/core";
  @use "@/assets/styles/mixins";

  .app-sources {
    padding-bottom: core.$spacing-8;
    background: core.$color-alabaster;

    &__title {
      @include mixins.apply-text("heading-2");
      display: flex;
      gap: core.$spacing-1;
      width: fit-content;
      align-items: center;
      margin: 0 auto core.$spacing-6;
    }

    &__icon {
      transition: transform 0.2s ease;

      &--active {
        transform: rotate(180deg);
      }
    }

    &__button {
      display: flex;
      place-items: center;
    }

    &__body {
      text-align: justify;
      margin: 0 auto;
      max-width: 700px;
      display: flex;
      flex-direction: column;
      gap: core.$spacing-2;
      @include mixins.apply-text("body");
    }
  }
</style>
